export const messages = [
  {
    "id": 1,
    "text": "Но разбавленное изрядной долей эмпатии, рациональное мышление говорит о возможностях форм воздействия.",
    "user": "Иванов Сергей",
    "incoming": false,
    "date": new Date(),
  },
  {
    "id": 2,
    "text": "Не следует, однако, забывать, что семантический разбор внешних противодействий однозначно фиксирует необходимость позиций, занимаемых участниками в отношении поставленных задач.",
    "user": "Иванов Сергей",
    "incoming": false,
    "date": new Date(),
  },
  {
    "id": 3,
    "text": "Имеется спорная точка зрения, гласящая примерно следующее: элементы политического процесса будут смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности.",
    "user": "Иванов Сергей",
    "incoming": true,
    "date": new Date(),
  },
  {
    "id": 4,
    "text": "С другой стороны, глубокий уровень погружения однозначно фиксирует необходимость инновационных методов управления процессами.",
    "user": "Иванов Сергей",
    "incoming": false,
    "date": new Date(),
  },
  {
    "id": 5,
    "text": "Учитывая ключевые сценарии поведения, современная методология разработки играет определяющее значение для экономической целесообразности принимаемых решений!",
    "user": "Иванов Сергей",
    "incoming": true,
    "date": new Date(),
  },
  {
    "id": 6,
    "text": "А также тщательные исследования конкурентов неоднозначны и будут функционально разнесены на независимые элементы.",
    "user": "Иванов Сергей",
    "incoming": false,
    "date": new Date(),
  },
  {
    "id": 7,
    "text": "Внезапно, представители современных социальных резервов призывают нас к новым свершениям, которые, в свою очередь, должны быть функционально разнесены на независимые элементы.",
    "user": "Иванов Сергей",
    "incoming": true,
    "date": new Date(),
  },
  {
    "id": 8,
    "text": "Таким образом, сложившаяся структура организации создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса глубокомысленных рассуждений.",
    "user": "Иванов Сергей",
    "incoming": false,
    "date": new Date(),
  },
  {
    "id": 9,
    "text": "Идейные соображения высшего порядка, а также синтетическое тестирование не оставляет шанса для модели развития.",
    "user": "Иванов Сергей",
    "incoming": false,
    "date": new Date(),
  }
  ,
  {
    "id": 10,
    "text": "Как принято считать, тщательные исследования конкурентов ассоциативно распределены по отраслям.",
    "user": "Иванов Сергей",
    "incoming": true,
    "date": new Date(),
  }
]
export const dialogs = [
    { id: 1, img: "123", name: "Олег", dateLastMsg: "14.10.2022", textLastMsg: "привет1" },
    { id: 2, img: "123", name: "Любовь", dateLastMsg: "13.10.2022", textLastMsg: "привет2" },
    { id: 3, img: "123", name: "Евгений", dateLastMsg: "12.10.2022", textLastMsg: "привет3" },
    { id: 4, img: "123", name: "Григорий", dateLastMsg: "15.10.2022", textLastMsg: "привет4" },
    { id: 5, img: "123", name: "Петр", dateLastMsg: "20.10.2022", textLastMsg: "привет5" },
    { id: 6, img: "123", name: "Екатерина", dateLastMsg: "28.10.2022", textLastMsg: "привет2" },
    { id: 7, img: "123", name: "Тимур", dateLastMsg: "06.10.2022", textLastMsg: "привет3" },
    { id: 8, img: "123", name: "Ульяна", dateLastMsg: "11.10.2022", textLastMsg: "привет4" },
    { id: 9, img: "123", name: "Харитон", dateLastMsg: "01.10.2022", textLastMsg: "привет5" },
]